/**
 * 通用错误码 状态码设置
 * 
 * 错误码由模块 0-9 a-z + 错误码组成  
 * 
 * 通用模块 0
 * 
 * 登录模块 1
 * 
 */

module.exports={
    //通用错误码处理
    '0200':{
        code:200,
        msg:'成功',
    },
    '0600':{
        code:600,
        msg:'失败，请重新尝试'
    },
    '0601':{
      code:601,
      msg:'查询数据失败',
    },
    '0602':{
        code:602,
        msg:'更新数据失败',
    },
    '0620':{ //上传问题
        code:620,
        msg:'请上传合法的文件类型'
    },
    '0801':{
        code:801,
        msg:'鉴权机制不通过'
    },
    '0802':{
        code:802,
        msg:'Token已过期，请重新登录'
    },

    //具体业务模块错误码处理
    /**登录模块 */
    '1101':{
        code:101,
        msg:'用户名或密码错误，请重试',
    }

}